; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	image4 - mode
	infrared5 - mode
	infrared2 - mode
	infrared1 - mode
	spectrograph0 - mode
	thermograph3 - mode
	Star0 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image4)
	(calibration_target instrument4 GroundStation7)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument5 infrared5)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 Star6)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument6 infrared5)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon12)
)
(:goal (and
	(pointing satellite1 Phenomenon8)
	(have_image Phenomenon8 infrared1)
	(have_image Phenomenon8 spectrograph0)
	(have_image Star9 infrared2)
	(have_image Star9 spectrograph0)
	(have_image Phenomenon10 infrared2)
	(have_image Star11 thermograph3)
	(have_image Star11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
))

)

; plan
1. (turn_to satellite2 groundstation2 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 9
2. (turn_to satellite1 groundstation1 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 9
3. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 0 of 9
4. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 9
5. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
7. (calibrate satellite2 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 9
8. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 9
9. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 9
10. (turn_to satellite0 star11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star11)
   goals met: 0 of 9
11. (take_image satellite0 star11 instrument0 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 1 of 9
12. (turn_to satellite1 phenomenon10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 9
13. (take_image satellite1 phenomenon10 instrument1 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 2 of 9
14. (turn_to satellite1 star9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star9)
   goals met: 2 of 9
15. (take_image satellite1 star9 instrument1 infrared2)
   added: (have_image star9 infrared2)
   goals met: 3 of 9
16. (turn_to satellite1 phenomenon8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 9
17. (take_image satellite1 phenomenon8 instrument1 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 5 of 9
18. (turn_to satellite2 phenomenon12 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon12)
   goals met: 5 of 9
19. (take_image satellite2 phenomenon12 instrument3 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 6 of 9
20. (turn_to satellite2 phenomenon8 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon8)
   goals met: 6 of 9
21. (take_image satellite2 phenomenon8 instrument3 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 7 of 9
22. (turn_to satellite2 star11 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star11)
   goals met: 7 of 9
23. (take_image satellite2 star11 instrument3 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 8 of 9
24. (turn_to satellite2 star9 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star9)
   goals met: 8 of 9
25. (take_image satellite2 star9 instrument3 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 9 of 9
